tsung/tsung_template.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="warning">
    <clients>
        <client host="localhost" use_controller_vm="true"/>
    </clients>

    <servers>
        <server host="blockchain-finder" port="8081" type="tcp"/>
    </servers>
    <monitoring>
        <monitor host="blockchain-finder" type="munin"/>
    </monitoring>

    <load>
        <arrivalphase phase="1" duration="%duration%" unit="minute">
            <users arrivalrate="%arrivalRate%" unit="second"/>
        </arrivalphase>
    </load>

    <options>
        <option name="file_server" id="tranx" value="/test_transactions_one.data"/>
    </options>
    <sessions>
        <session name="es_load" weight="1" type="ts_http">
            <setdynvars sourcetype="file" fileid="tranx" delimiter="\n" order="random">
                <var name="tx"/>
            </setdynvars>

            <request subst="true">
                <http url="/search?tx_id=%%_tx%%" method="GET"/>
            </request>
        </session>
    </sessions>
</tsung>