tsung/tsung_template.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="warning">
    <clients>
        <client host="localhost" use_controller_vm="true"/>
    </clients>


    <servers>
        <server host="blockchain-finder" port="8080" type="tcp"/>
    </servers>

    <load>
        <arrivalphase phase="1" duration="%duration%" unit="minute">
            <users arrivalrate="%arrivalRate%" unit="second"/>
        </arrivalphase>
    </load>

    <options>
        <option name="file_server" id="tranx" value="/root/.tsung/test_transactions.data"/>
    </options>

    <sessions>
        <session name="es_load" weight="1" type="ts_http">
            <setdynvars sourcetype="file" fileid="tranx" delimiter="\n" order="random">
                <var name="tx"/>
            </setdynvars>

            <request>
                <http url="/" method="GET"/>
            </request>

            <request subst="true">
                <http url="/search?no_redis&amp;tx_id=%%_tx%%" method="GET"/>
            </request>
        </session>
    </sessions>
</tsung>